In [5]:
!pip install psycopg2

Collecting psycopg2
  Downloading https://files.pythonhosted.org/packages/44/1f/a6ae3527568bb9a3d49339beb630ede2dcb345c88cc3cdc2a6dfbb78110e/psycopg2-2.8.6-cp37-cp37m-win_amd64.whl (1.1MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.6

In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

# %sql postgresql://username:password@host:port/databasename

In [19]:
%sql postgresql://postgres:zoutianjian0228@localhost:5433/BDMI-2020A

# --通过这里连接到你本地的数据库，在软件上进行操作

In [15]:
#%sql postgresql://gpadmin:gpdb2020@101.6.160.22:4132/testdb

# Create Movies Table

In [21]:
%%sql
DROP TABLE IF EXISTS Movies;
CREATE TABLE Movies(title VARCHAR(50), year INT, director VARCHAR(50), length INT);
INSERT INTO Movies VALUES('algorithm', 1967, 'Joe', 123);
INSERT INTO Movies VALUES('data structure', 1992, 'Bob', 190);
INSERT INTO Movies VALUES('database', 1998, 'Jim', 176);

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [22]:
%sql SELECT * FROM movies

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
3 rows affected.

[('algorithm', 1967, 'Joe', 123),
 ('data structure', 1992, 'Bob', 190),
 ('database', 1998, 'Jim', 176)]

In [23]:
%sql DROP TABLE IF EXISTS A; DROP TABLE IF EXISTS B;
%sql CREATE TABLE A (x int, y int); CREATE TABLE B (x int, y int);
for i in range(1,6):
    %sql INSERT INTO A VALUES (:i, :i+1)
for i in range(1,11,3):
    %sql INSERT INTO B VALUES (:i, :i+2)

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
Done.
Done.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
Done.
Done.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.
 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.

In [24]:
%sql SELECT * FROM A

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
5 rows affected.

[(1, 2), (2, 3), (3, 4), (4, 5), (5, 6)]

In [25]:
%%sql
SELECT m.title 
FROM Movies m
WHERE m.year <> ANY(SELECT year FROM Movies WHERE title = m.title);

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
0 rows affected.

[]

In [26]:
%%sql
SELECT DISTINCT m1.title
FROM movies m1, movies m2
WHERE m1.title = m2.title AND m1.year <> m2.year;

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
0 rows affected.

[]

# Create Product Table

In [27]:
%%sql drop table if exists product;
create table product(
       pname        varchar primary key, -- name of the product
       price        money,               -- price of the product
       category     varchar,             -- category
       manufacturer varchar NOT NULL     -- manufacturer
);
insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [28]:
%sql select * from product;

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
4 rows affected.

[('Gizmo', '￥19.99', 'Gadgets', 'GizmoWorks'),
 ('PowerGizmo', '￥29.99', 'Gadgets', 'GizmoWorks'),
 ('SingleTouch', '￥149.99', 'Photography', 'Canon'),
 ('MultiTouch', '￥203.99', 'Household', 'Hitachi')]

In [29]:
%%sql
SELECT * from Product 
WHERE category='Gadgets' and price > 20.0::money;

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
1 rows affected.

[('PowerGizmo', '￥29.99', 'Gadgets', 'GizmoWorks')]

In [30]:
%%sql 
SELECT Pname, Price, Manufacturer
FROM Product;

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
4 rows affected.

[('Gizmo', '￥19.99', 'GizmoWorks'),
 ('PowerGizmo', '￥29.99', 'GizmoWorks'),
 ('SingleTouch', '￥149.99', 'Canon'),
 ('MultiTouch', '￥203.99', 'Hitachi')]

In [31]:
%%sql
SELECT Pname, Price, Manufacturer
FROM Product
WHERE category='Gadgets';

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
2 rows affected.

[('Gizmo', '￥19.99', 'GizmoWorks'), ('PowerGizmo', '￥29.99', 'GizmoWorks')]

In [32]:
%%sql
SELECT * FROM Product;

SELECT
    p.manufacturer, p.pname, p.price
FROM 
    (SELECT distinct p0.Manufacturer
     FROM Product p0
     WHERE p0.price < 20.00::money) cp, -- this is a nested query!
    Product p
WHERE 
    p.manufacturer = cp.manufacturer and p.price >= 20.00::money

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
4 rows affected.
1 rows affected.

[('GizmoWorks', 'PowerGizmo', '￥29.99')]

# Create Company Table

In [33]:
%%sql
drop table if exists product; -- This needs to be dropped if exists, see why further down!
drop table if exists company;
create table company (
    cname varchar primary key, -- company name uniquely identifies the company.
    stockprice money, -- stock price is in money 
    country varchar); -- country is just a string
insert into company values ('GizmoWorks', 25.0, 'USA');
insert into company values ('Canon', 65.0, 'Japan');
insert into company values ('Hitachi', 15.0, 'Japan');

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
Done.
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [34]:
%sql select * from company;

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
3 rows affected.

[('GizmoWorks', '￥25.00', 'USA'),
 ('Canon', '￥65.00', 'Japan'),
 ('Hitachi', '￥15.00', 'Japan')]

In [35]:
%%sql drop table if exists product;
create table product(
       pname varchar primary key, -- name of the product
       price money, -- price of the product
       category varchar, -- category
       manufacturer varchar, -- manufacturer
       foreign key (manufacturer) references company(cname));

insert into product values('Gizmo', 19.99, 'Gadgets', 'GizmoWorks');
insert into product values('PowerGizmo', 29.99, 'Gadgets', 'GizmoWorks');
insert into product values('SingleTouch', 149.99, 'Photography', 'Canon');
insert into product values('MultiTouch', 203.99, 'Household', 'Hitachi');

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
Done.
Done.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
try:
    %sql insert into product values('MultiTouch', 203.99, 'Household', 'Google');
except Exception as e:
    print(e) 
    print("Rejected!")

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
(psycopg2.errors.UniqueViolation) 错误:  重复键违反唯一约束"product_pkey"
DETAIL:  键值"(pname)=(MultiTouch)" 已经存在

[SQL: insert into product values('MultiTouch', 203.99, 'Household', 'Google');]
(Background on this error at: http://sqlalche.me/e/13/gkpj)
Rejected!

# Joins

In [37]:
%%sql
SELECT pname, price
FROM product, company
where manufacturer=cname and country='Japan';

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
2 rows affected.

[('SingleTouch', '￥149.99'), ('MultiTouch', '￥203.99')]

In [38]:
%%sql -- duplicate answer
SELECT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
(psycopg2.errors.SyntaxError) 错误:  语法错误 在 "duplicate" 或附近的
LINE 1: duplicate answer SELECT Country
        ^

[SQL: duplicate answer SELECT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';]
(Background on this error at: http://sqlalche.me/e/13/f405)

In [39]:
%%sql -- duplicate answer
SELECT DISTINCT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';

 * postgresql://postgres:***@localhost:5433/BDMI-2020A
(psycopg2.errors.SyntaxError) 错误:  语法错误 在 "duplicate" 或附近的
LINE 1: duplicate answer SELECT DISTINCT Country
        ^

[SQL: duplicate answer SELECT DISTINCT Country
FROM Product, Company
WHERE  Manufacturer=CName AND Category='Gadgets';]
(Background on this error at: http://sqlalche.me/e/13/f405)